from aiogram import Router, types, F
from keyboards import keyboards

router = Router()

def register(dp):
    dp.include_router(router)


@router.message(F.text == "Что я умею")
async def help_menu(msg: types.Message):
    text = (
        "💡 Я умею:\n\n"
        "• Показывать горячие билеты 🔥\n"
        "• Искать билеты по простому маршруту ✈️\n"
        "• Искать билеты по сложному маршруту (в разработке) 🧩\n"
        "• Помогать выбрать даты через календарь 📅\n"
        "• Работать с багажом / пересадками 🎒\n"
        "• Собирать запрос поиска и готовить его для API\n"
        "• В будущем:\n"
        "    – Подключение Aviasales API\n"
        "    – Подсказки городов\n"
        "    – Сохранение билетов в базу данных\n"
        "    – Отслеживание цены билетов\n"
        "    – Уведомления об изменениях\n\n"
        "Выберите действие из меню 👇"
    )

    await msg.answer(text, reply_markup=keyboards.main_menu())
